In [353]:
import pandas as pd

# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [356]:
#Write your code here
df_data = pd.read_csv('Purchase_Data.csv')
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [358]:
#Write your code here
df_data.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [360]:
#Write you code here
result_1 = df_data.loc[:,['invoice_number','invoice_time']]
result_1

      invoice_number   invoice_time
0       2.020000e+11  7/15/15 10:45
1       2.020000e+11  7/15/15 12:16
2       2.020000e+11  7/15/15 12:16
3       2.020000e+11  7/15/15 12:16
4       2.020000e+11  7/15/15 12:16
...              ...            ...
5377    2.020000e+11   9/5/15 23:07
5378    2.020000e+11   9/5/15 23:23
5379    2.020000e+11   9/5/15 23:24
5380    2.020000e+11   9/5/15 23:32
5381    2.020000e+11   9/5/15 23:38

[5382 rows x 2 columns]

Slice the first two rows using .loc and store the result in a variable called result_2.

In [362]:
#Write you code here
result_2 = df_data.iloc[0:2]
result_2

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [364]:
#Write your code here
result_3 = df_data.loc[0:3,['invoice_number' , 'invoice_time' , 'store_id' , 'product_id' , 'category_id']]
result_3

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [366]:
#Write your code here
result_4 = df_data.loc[[0,4,6],['invoice_time','price']]
result_4

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [368]:
#df_data.count(axis = 0)
num_rows = df_data.index.size # 1 OR
num_rows = df_data.shape[0]   # 2 OR
num_rows = len(df_data)       # 3
num_rows

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [370]:
#Write your code here
df_data.iloc[num_rows-1] # OR .loc

invoice_number    202000000000.0
invoice_time        9/5/15 23:38
store_id                    G619
product_id              23030206
category_id               210101
num_item                     1.0
price                        2.0
Name: 5381, dtype: object

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [373]:
#Write your code here
Total = df_data.price.sum()
avg_price = Total/num_rows
max_price = df_data['price'].max()
print(avg_price ,"\n", max_price)

3.1920522110741363
 6.01

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [375]:
#Write you code here
avg_price = df_data.price.mean()
avg_num_items = df_data.num_item.mean()
print(avg_price ,"\n", avg_num_items)

3.1920522110741363
 1.2983091787439613

Create a column called "total", which is the product of the price and num_item columns.

In [377]:
#Write your code here
#df_data['total'] = df_data['price'] + df_data['num_item'] #method 1
#df_data = df_data.drop(columns ='total')  #Delete Column
df_data['total'] = df_data.iloc[:,[5,6]].sum(axis=1) #method 2
df_data

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,3.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,3.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,3.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,7.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,7.0
...,...,...,...,...,...,...,...,...
5377,2.020000e+11,9/5/15 23:07,300,7308017,210101,1.0,3.0,4.0
5378,2.020000e+11,9/5/15 23:23,G619,7070891,70401,1.0,6.0,7.0
5379,2.020000e+11,9/5/15 23:24,G619,7071096,70201,1.0,5.0,6.0
5380,2.020000e+11,9/5/15 23:32,G619,15000231,70301,2.0,2.0,4.0
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0,3.0

What is the avgerage price of the three most expensive purchases?

In [379]:
#Write your code here
df_temp = df_data.sort_values('price', ascending = 0)
avg_temp_price1 = df_temp.price[0:3].mean() # method 1
#*************************#
sum_temp = df_temp.price.head(3).sum()      # method 2
avg_temp_price2 = sum_temp/3

print(avg_temp_price1 , "\n" , avg_temp_price2)

6.003333333333333
 6.003333333333333

How many different products are there?

In [381]:
#Write your code here
num_prod = df_data.product_id.index.size
num_prod

5382

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [383]:
#Write your code here
median = df_data.total.median(axis = 0)
mean = df_data.total.mean(axis = 0)
print(f"Median = {median} , Mean = {mean} .\n")
temp_df = df_data.total.describe()
print(temp_df)
temp_df = temp_df.index
print(temp_df)

Median = 4.0 , Mean = 4.490361389818098 .

count    5382.000000
mean        4.490361
std         2.647166
min         1.000000
25%         3.000000
50%         4.000000
75%         6.000000
max       119.000000
Name: total, dtype: float64
Index(['count', 'mean', 'std', 'min', '25%', '50%', '75%', 'max'], dtype='object')

Use the drop() method to delete the column total from the dataframe df_data.

In [385]:
#Write your code here
df_data = df_data.drop(columns ='total')
df_data

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0
...,...,...,...,...,...,...,...
5377,2.020000e+11,9/5/15 23:07,300,7308017,210101,1.0,3.0
5378,2.020000e+11,9/5/15 23:23,G619,7070891,70401,1.0,6.0
5379,2.020000e+11,9/5/15 23:24,G619,7071096,70201,1.0,5.0
5380,2.020000e+11,9/5/15 23:32,G619,15000231,70301,2.0,2.0
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0

Let's dig a little deeper into the data set and answer some basic question.

In [387]:
#Write your code here

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [389]:
#Write your code here
df_data.invoice_time = pd.to_datetime(df_data['invoice_time'])
df_data.dtypes

C:\Users\Mohamed Montasser\AppData\Local\Temp\ipykernel_14976\415533554.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_data.invoice_time = pd.to_datetime(df_data['invoice_time'])

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
dtype: object

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [391]:
#Write your code here
df_data['Month'] = pd.to_datetime(df_data['invoice_time']).dt.month
df_data['DOW'] = pd.to_datetime(df_data['invoice_time']).dt.day_name()
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,Month,DOW
0,2.020000e+11,2015-07-15 10:45:00,G816,7000300,210101,1.0,2.0,7,Wednesday
1,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,7,Wednesday
2,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,7,Wednesday
3,2.020000e+11,2015-07-15 12:16:00,G816,7070891,70401,1.0,6.0,7,Wednesday
4,2.020000e+11,2015-07-15 12:16:00,G816,7090363,70401,1.0,6.0,7,Wednesday

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [393]:
#Write your code here
df_wed = df_data.loc[df_data.DOW == "Wednesday"] 
#num_purchases_wed = df_wed.num_item.sum(axis = 0)
#*****************************************************#
num_purchases_wed = df_wed.invoice_time.value_counts()
num_purchases_wed = num_purchases_wed.index.size
print(num_purchases_wed)

619

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [396]:
#Write your code here
df_titanic = pd.read_csv('Titanic.csv')
df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [398]:
#Write your code here
df_titanic = df_titanic.rename(columns={'Name': 'Passenger_Name', 'Ticket': 'Ticket_Num'})
df_titanic.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Change the index of the df_titanic to the column PasengerID.

In [400]:
#Write your code here
#df_titanic.index = df_titanic.PassengerId
df_titanic = df_titanic.set_index("PassengerId")
df_titanic.head()

,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Select the name of passenger 896

In [402]:
#Write your code here
df_titanic['Passenger_Name'].loc[df_titanic.index==896]

PassengerId
896    Hirvonen, Mrs. Alexander (Helga E Lindqvist)
Name: Passenger_Name, dtype: object

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [404]:
#Write your code here
#df_titanic = df_titanic.drop(columns ='PassengerId')
df_titanic.reset_index(inplace=True)
df_titanic.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [406]:
#Write you code here
temp = pd.isnull(df_titanic["Age"])
 
# Counting missing values in the "Team" column
missing_values_count = temp.sum()
missing_values_count

86

Compute the avg age of passengers ignoring the missing data.

In [408]:
#Write your code here
temp = df_titanic.Age.notnull()
df_titanic_temp = df_titanic[temp]
avg_age = df_titanic_temp.Age.mean()
avg_age

30.272590361445783

Using the fillna() method replace the missing values in the Age column with the mean.

In [410]:
#Write your code here
#df_titanic.head()

df_titanic.Age = df_titanic.Age.fillna(avg_age)
df_titanic.Age.isnull().sum()

0

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [412]:
#Write your code here
df_temp2 = df_titanic.sort_values('Age', ascending = 0)
avg_Age = df_temp2.Age[0:5].mean()
avg_Age

67.0